"""
Имеется 2 кортежа с координатами Ферзя и Пешки на шахматной доске
Определить Бьет ли Ферзь пешку
координаты хранятся (x, y)



queen_coordinate = input("Введите координы ферзя (x, y)\n>>")
pawn_coordinate = input("Введите координы пешки (x, y)\n>>").split(" ")
for coord_1 in pawn_coordinate:
    if coord_1.isdigit():
        coord_1 = int(coord_1)
    else:
        print("Ошибка ввода")
"""
