"""
2.2
Дан словарь с кодированием строк азбуки Морзе
Реализовать функцию декодирующую морзе строку обратно в читаемый текст.
Обратите внимание что используется только символы латинского Алфавита в lower case.
При этом строка должна всегда начинаться с заглавной буквы
"""
MORSE = {'.-': 'a', '-...': 'b', '-.-.': 'c',
         '-..': 'd', '.': 'e', '..-.': 'f',
         '--.': 'g', '....': 'h', '..': 'i',
         '.---': 'j', '-.-': 'k', '.-..': 'l',
         '--': 'm', '-.': 'n', '---': 'o',
         '.--.': 'p', '--.-': 'q', '.-.': 'r',
         '...': 's', '-': 't', '..-': 'u',
         '...-': 'v', '.--': 'w', '-..-': 'x',
         '-.--': 'y', '--..': 'z', '-----': '0',
         '.----': '1', '..---': '2', '...--': '3',
         '....-': '4', '.....': '5', '-....': '6',
         '--...': '7', '---..': '8', '----.': '9'
         }

morse_code = '.... . .-.. .-.. ---  -- .. ... - . .-.  .--- .. -. --. .-.. . ...'


def morse_decode(coded_text, morse_dict):
    """
    Return the text string was decrypted from the Morse code string
    """
    decoded_text = ''
    for item in coded_text.split(' '):
        if item == '':
            decoded_text += f'{item} '
            continue
        decoded_text += item.replace(item, morse_dict[item])
    return decoded_text.capitalize()


print(morse_decode(morse_code, MORSE))
